# Table Merges

## Imports

In [36]:
# IMPORTS
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

## Load Data

In [37]:
# DATA
aircraft_df = pd.read_csv('raw_data/08_23_aircraft.csv')
events_df = pd.read_csv('raw_data/08_23_events.csv')
flight_crew_df = pd.read_csv('raw_data/08_23_Flight_Crew.csv')
flight_time_df = pd.read_csv('raw_data/08_23_flight_time.csv')
engines_df = pd.read_csv('data/engines_fin.csv')
events_sequence_df = pd.read_csv('data/Events_Sequence_fin.csv')

/var/folders/bm/jkrgnvss6lj9nx3qfzmdw0_m0000gn/T/ipykernel_28290/1336274412.py:2: DtypeWarning: Columns (0,59) have mixed types. Specify dtype option on import or set low_memory=False.
  aircraft_df = pd.read_csv('raw_data/08_23_aircraft.csv')
/var/folders/bm/jkrgnvss6lj9nx3qfzmdw0_m0000gn/T/ipykernel_28290/1336274412.py:3: DtypeWarning: Columns (0,31,51) have mixed types. Specify dtype option on import or set low_memory=False.
  events_df = pd.read_csv('raw_data/08_23_events.csv')

## Flight time

In [38]:
mask = flight_time_df['flight_craft'] == 'ALL' 
flight_time_df = flight_time_df[mask]

mask_2 = flight_time_df['flight_type'] == 'TOTL'
flight_time_df = flight_time_df[mask_2]

flight_time_df['id'] = (flight_time_df['ev_id'].astype(str) + flight_time_df['Aircraft_Key'].astype(str)).astype('object')
flight_time_df.drop(['ev_id', 'Aircraft_Key'], axis=1, inplace=True)

flight_time_df

,crew_no,flight_type,flight_craft,flight_hours,lchg_date,lchg_userid,id
12,1,TOTL,ALL,705.0,2020-09-25 18:05:31,NaN,20080107X000261
34,1,TOTL,ALL,8300.0,2020-09-25 18:05:31,NaN,20080107X000262
58,1,TOTL,ALL,1000.0,2020-09-25 18:05:31,NaN,20080109X000361
64,1,TOTL,ALL,10571.0,2020-09-25 18:04:02,NaN,20080107X000271
75,1,TOTL,ALL,18.0,2020-09-25 18:06:16,NaN,20080115X000511
...,...,...,...,...,...,...,...
327105,2,TOTL,ALL,122.0,2023-04-20 18:02:40,coln,202303131068891
327122,1,TOTL,ALL,74.0,2023-04-27 18:00:03,coln,202303201069201
327160,1,TOTL,ALL,23000.0,2023-04-27 18:00:03,coln,202303241069471
327171,1,TOTL,ALL,33100.0,2023-05-04 18:00:11,fina,202303311069871
327189,1,TOTL,ALL,32.0,2023-05-11 18:00:35,coln,202304101070311

In [39]:
flight_time_df.head()

,crew_no,flight_type,flight_craft,flight_hours,lchg_date,lchg_userid,id
12,1,TOTL,ALL,705.0,2020-09-25 18:05:31,NaN,20080107X000261
34,1,TOTL,ALL,8300.0,2020-09-25 18:05:31,NaN,20080107X000262
58,1,TOTL,ALL,1000.0,2020-09-25 18:05:31,NaN,20080109X000361
64,1,TOTL,ALL,10571.0,2020-09-25 18:04:02,NaN,20080107X000271
75,1,TOTL,ALL,18.0,2020-09-25 18:06:16,NaN,20080115X000511

In [40]:
flight_time_df.set_index('id', inplace=True)
flight_hours_mean = pd.DataFrame(flight_time_df['flight_hours'].groupby('id').mean())
flight_hours_mean.columns = ['flight_hours_mean']

In [41]:
flight_time_df = flight_time_df[['flight_type', 'flight_craft']]
flight_time_df.head()

                flight_type flight_craft
id
20080107X000261        TOTL          ALL
20080107X000262        TOTL          ALL
20080109X000361        TOTL          ALL
20080107X000271        TOTL          ALL
20080115X000511        TOTL          ALL

In [42]:
flight_hours_mean

                 flight_hours_mean
id
20080107X000261              705.0
20080107X000262             8300.0
20080107X000271            10571.0
20080109X000361             1000.0
20080114X000441              537.0
...                            ...
202303131068891              122.0
202303201069201               74.0
202303241069471            23000.0
202303311069871            33100.0
202304101070311               32.0

[19552 rows x 1 columns]

In [43]:
flight_time_mean = flight_hours_mean.join(flight_time_df, how='inner')
flight_time_mean = flight_time_mean[~flight_time_mean.index.duplicated(keep='first')]

In [44]:
flight_time_mean.shape

(19552, 3)

## Flight crew

In [45]:
flight_crew_df = flight_crew_df[['ev_id', 'Aircraft_Key', 'crew_category', 'crew_sex', 'pc_profession', 'crew_tox_perf', 'mr_faa_med_certf', 'available_restraint']]

In [46]:
mask = flight_crew_df['crew_category'] == 'PLT' 
flight_crew_df = flight_crew_df[mask]



flight_crew_df['id'] = (flight_crew_df['ev_id'].astype(str) + flight_crew_df['Aircraft_Key'].astype(str)).astype('object')
flight_crew_df.drop(['ev_id', 'Aircraft_Key'], axis=1, inplace=True)

In [47]:
flight_crew_df.set_index('id', inplace=True)
flight_crew_df.head()

,crew_category,crew_sex,pc_profession,crew_tox_perf,mr_faa_med_certf,available_restraint
id,,,,,,
20080107X000261,PLT,M,No,N,NaN,NaN
20080107X000262,PLT,M,No,N,NaN,NaN
20080109X000361,PLT,F,No,N,NaN,NaN
20080107X000271,PLT,M,UNK,N,NaN,NaN
20080115X000471,PLT,M,No,N,NaN,NaN

In [48]:
flight_crew_df.shape

(19163, 6)

In [49]:
flight_time_crew = flight_time_mean.join(flight_crew_df, how='inner')
flight_time_crew.shape

(18005, 9)

## Aircraft

In [50]:
aircraft_df = aircraft_df[['ev_id', 'Aircraft_Key', 'far_part', 'flt_plan_filed', 'acft_make',  'acft_model', 'fc_seats', 'cc_seats', 'pax_seats', 'num_eng', 'fixed_retractable', 'cert_max_gr_wt', 'acft_category', 'homebuilt', 'type_last_insp', 'afm_hrs_last_insp', 'afm_hrs', 'elt_install', 'elt_type', 'oper_dba', 'certs_held', 'type_fly', 'second_pilot', 'dprt_apt_id', 'dprt_time', 'dest_apt_id', 'site_seeing', 'air_medical']]

aircraft_df['id'] = (aircraft_df['ev_id'].astype(str) + aircraft_df['Aircraft_Key'].astype(str)).astype('object')
aircraft_df.drop(['ev_id', 'Aircraft_Key'], axis=1, inplace=True)

In [51]:
aircraft_df.set_index('id', inplace=True)
aircraft_df.head()

,far_part,flt_plan_filed,acft_make,acft_model,fc_seats,cc_seats,pax_seats,num_eng,fixed_retractable,cert_max_gr_wt,...,elt_type,oper_dba,certs_held,type_fly,second_pilot,dprt_apt_id,dprt_time,dest_apt_id,site_seeing,air_medical
id,,,,,,,,,,,,,,,,,,,,,
20080211X001751,NUSN,NaN,Eurocopter France,AS350B3,NaN,NaN,NaN,NaN,FIXD,NaN,...,NaN,NaN,NaN,EXLD,NaN,NaN,NaN,NaN,N,N
20080107X000261,091,NONE,PIPER,PA 28-180,NaN,NaN,NaN,1.0,FIXD,2400.0,...,NaN,NaN,Y,PERS,N,O69,2200.0,OQ3,N,N
20080107X000262,091,NONE,Barnard/Stancil,Glastar,NaN,NaN,NaN,1.0,FIXD,1960.0,...,NaN,NaN,Y,PERS,N,OQ3,2230.0,O70,N,N
20080109X000361,091,NONE,Micco Aircraft Company,MAC-145B,NaN,NaN,NaN,1.0,RETR,2850.0,...,NaN,NaN,Y,PERS,N,T20,2100.0,AXH,N,N
20080107X000271,091,IFR,Pilatus,PC-12/45,NaN,NaN,NaN,1.0,RETR,9920.0,...,NaN,NaN,Y,PERS,N,PHX,400.0,PWA,N,N

In [52]:
aircraft_fc_ft = aircraft_df.join(flight_time_crew, how='inner')
aircraft_fc_ft.shape

(18005, 35)

## Engines

In [53]:
engines_df.shape

(23669, 14)

In [54]:
engines_df.drop(columns=["Unnamed: 0", "eng_time_total", "eng_time_last_insp", "eng_time_overhaul"], inplace=True)

mask = engines_df['eng_no'] == 1 
engines_df = engines_df[mask]

engines_df['id'] = (engines_df['ev_id'].astype(str) + engines_df['Aircraft_Key'].astype(str)).astype('object')
engines_df.drop(['ev_id', 'Aircraft_Key'], axis=1, inplace=True)
engines_df.set_index('id', inplace=True)

In [55]:
engines_df.shape

(20876, 8)

## Wingman X and y

In [56]:
X = aircraft_fc_ft.join(engines_df, how='inner')

In [58]:
y = events_sequence_df.copy()
y.set_index('id', inplace=True)

In [59]:
wingman_data = y.join(X, how='inner')
wingman_data = wingman_data[~wingman_data.index.duplicated(keep='first')]

In [60]:
wingman_data.shape

(17166, 45)

In [61]:
wingman_data.shape, events_sequence_df.shape

((17166, 45), (25154, 3))

In [62]:
events_sequence_df.set_index('id', inplace=True)
events_sequence_df.head()

                 phase_no  eventsoe_no
id
20080107X000261       550          250
20080107X000262       350          250
20080109X000361       551          230
20080107X000271       153           81
20080115X000511       551          240

In [63]:
wingman_data_indices = list(wingman_data.index)
events_sequence_indices = list(events_sequence_df.index)

In [64]:
missing_indices = [i for i in events_sequence_indices if i not in wingman_data_indices]